app/Controllers/TodoListController.php

INSERT INTO `TodoLists` (`t_title`, `t_content`, `created_at`, `updated_at`) VALUES ('pass_in_title_6', 'pass_in_content_6', '2023-06-06 15:27:19', '2023-06-06 15:27:19')
---
    public function create()
    {
        // Get the data from the request.
        $data = $this->request->getJSON();
        $title = $data->title ?? null;
        $content = $data->content ?? null;

        // Check if title and content are present.
        if ($title === null || $content === null) {
            return $this->fail("Required data is not found.", 404);
        }

        // Check if title or content is empty.
        if ($title === "" || $content === "") {
            return $this->fail("Title or content cannot be empty.", 404);
        }

        // Insert data into the database.
        $createdKey = $this->todoListModel->insert([
            "t_title" => $title,
            "t_content" => $content,
            "created_at" => date("Y-m-d H:i:s"),
            "updated_at" => date("Y-m-d H:i:s"),
        ]);