app/Models/LoginModel.php

SELECT *
FROM `users`
WHERE `username` = '3'
---
    public function getUserByUsername($username)
    {
        // 從資料庫中獲取使用者資訊的邏輯
        // 可以使用 Query Builder 或 ORM 等方式進行資料庫查詢
        return $this->db->table('users')->where('username', $username)->get()->getRow();